# ZoneCalculatedCoolingLoadParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneCalculatedCoolingLoadParam Property
ParameterTypeId Class See Also
---
"Calculated Cooling Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneCalculatedCoolingLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneCalculatedCoolingLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneCalculatedCoolingLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace